---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AreaReinforcement
source: html/19c69017-745e-9365-1dc7-31e0e6421011.htm
---
# AreaReinforcement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.